
/*
//--створити масив та вивести його в консоль
let numbers = ['1', '2', '3'];
console.log(numbers);

//- з 5 числових значень
let numbers5 = [1, 2, 3, 4, 5];
console.log(numbers5);

//- з 5 стічкових значень
let words5 = ['A', 'B', 'C', 'D', 'E'];
console.log(words5);

//- з 5 значень стрічкового, числового та булевого типу
let arr = ['Hello', 'What', 2, true, 4];
console.log(arr);

//-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
let arr2 = [];
arr2[0] = 'Viktor';
arr2[3] = 2;
arr2[4] = true;
console.log(arr2);

//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

for (let i = 0; i <= 10; i++) {
    document.write('<div>просто текст</div>');
}

//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

for (let i = 0; i <= 10; i++) {
    document.write(`<div>просто текст -${i} </div>`);
}

//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

i = 0;
while (i <= 20) {
    document.write(`<div><h1>text</h1></div>`);
    i++;
};

//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

i = 0;
while (i <= 20) {
    document.write(`<div><h1>text - ${i}</h1></div>`);
    i++;
};

//- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
let numbers10 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (let i = 0; i < numbers10.length; i++) {
    console.log(numbers10[i]);
}

//- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
let numbers10 = ['A', 'B', 'C', 'B', 'D', 'a', 'b', 'c', 'd', 'e'];
for (let i = 0; i < numbers10.length; i++) {
    console.log(numbers10[i]);
}

//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

let arr = ['a', 2, 'b', true, 5, false, 7, 'c', 9, true];
for (let elem of arr) {
    if (typeof elem === 'boolean')
        console.log(elem);
}


//- Створити масив з 10 елементів числового, стірчкового і булевого типу.
// За допомогою if та typeof вивести тільки числові елементи
let arr1 = ['a', 2, 'b', true, 5, false, 7, 'c', 9, true];
for (let elem1 of arr) {
    if (typeof elem1 === 'number')
        console.log(elem1);
}

//- Створити масив з 10 елементів числового, стрічкового і булевого типу.
// За допомогою if та typeof вивести тільки рядкові елементи
let arr1 = ['a', 2, 'b', true, 5, false, 7, 'c', 9, true];
for (let elem1 of arr1) {
    if (typeof elem1 === 'string')
        console.log(elem1);
}


//- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
//Вивести в консоль всі його елементи в циклі.

let arr = [];
arr[0] = 1;
arr[1] = 2;
arr[2] = 3;
console.log(arr);

//Створити цикл for на 10  ітерацій з кроком 1.
//Вивести поточний номер кроку через console.log та document.write

for (let i = 0; i <= 10; i += 2) {
    console.log(i);
    document.write(i);
}

//- Створити цикл for на 100 ітерацій з кроком 1.
//Вивести поточний номер кроку через console.log та document.write
for (let i = 0; i <= 100; i += 2) {
    console.log(i);
    document.write(i);
}

//- Створити цикл for на 100 ітерацій з кроком 2.
// Вивести поточний номер кроку через console.log та document.write
for (let i = 0; i <= 100; i += 3) {
    console.log(i);
    document.write(i);
}

//- Створити цикл for на 100 ітерацій.
//Вивести тільки парні кроки. через console.log + document.write
for (let i = 0; i <= 100; i++) {
    if (i % 2 == 0) {
        console.log(i);
        document.write(i);
    }
}

//- Створити цикл for на 100 ітерацій.
//Вивести тільки непарні кроки. через console.log + document.write
for (let i = 0; i <= 100; i++) {
    if (i % 2 !== 0) {
        console.log(i);
        document.write(i);
    }
}

//- Відтворити роботу годинника, відрахувавши 2 хвилини
//(2 цикли! 1й - хвилини, 2й - секунди)

for (let minuts = 0; minuts < 60; minuts++) {
    for (let seconds = 0; seconds < 60; seconds++) {
        if (minuts === 2 && seconds === 1) {
            break
        } console.log(`${minuts}:${seconds}`);
    }
    if (minuts === 2) {
        break
    }
}

//- Відтворити роботу годинника, відрахувавши  2 години 20 хвилини !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//(3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

let time = '0 : 0 : 0';
let minuts = 0
let seconds = 0

for (let hour = 0; hour <= 2; hour++) {
    for (minuts = 0; minuts < 60; minuts++) {
        for (seconds = 0; seconds < 60; seconds++) {
            if (time === '2 : 20 : 0') {
                break
            }
            time = `${hour} : ${minuts} : ${seconds}`
            console.log(time);
        }
    }
}


//- Дано масив: [ 'a', 'b', 'c'] .
// За допомогою циклу for/while зібрати всі букви в слово.

let wordsFor = ['a', 'b', 'c'];
for (i = 0; i < wordsFor.length; i++) {
    console.log(wordsFor[i]);
}

let j = 0;
let wordsWhile = ['a', 'b', 'c'];
while (j < wordsWhile.length) {
    document.write(wordsWhile[j]);
    j++;
}

//- Дан масив ['a', 'b', 'c'].
// Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
let arr2 = ['a', 'b', 'c'];
let num1 = [1, 2, 3];
for (let i = 0; i < num1.length; i++) {
    if (arr2.length < 6)
        arr2.push(num1[i]);
}
console.log(arr2);

//- Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
let m1 = [1, 2, 3];
let m2 = m1.reverse();
for (let i = 0; i < m1.length; i++) {
    document.write(m2[i])
}

//- Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
let m1 = [1, 2, 3];
let m2 = [4, 5, 6];
for (let i = 0; i < m2.length; i++) {
    if (m1.length < 6) {
        m1.push(m2[i])
    }
} document.write(m1);

//- Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
let m1 = [1, 2, 3];
let m2 = [4, 5, 6];
for (let i = 0; i < m2.length; i--) {
    if (m1.length < 6) {
        m1.unshift(m2[i])
    }
} document.write(m1);

//- Дан масив ['js', 'css', 'jq'].
//Виведіть на екран перший елемент за допомогою shift()
let scil = ['js', 'css', 'jq'];
let newScil = scil.shift();
document.write(newScil);

//- Дан масив ['js', 'css', 'jq'].
// Виведіть на екран останній елемент за допомогою pop()
let scil = ['js', 'css', 'jq'];
document.write(scil.pop());

//- Дан масив [1, 2, 3, 4, 5].
// За допомогою методу/функції slice перетворіть масив в [4, 5].
let scil1 = [1, 2, 3, 4, 5];
console.log(scil1.slice(3, 5));

//- Дан масив [1, 2, 3, 4, 5].
//За допомогою методу/функції slice перетворіть масив в [1,2].
let scil2 = [1, 2, 3, 4, 5];
console.log(scil2.slice(0, 2));

//- Дан масив [1, 2, 3, 4, 5].
// За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
let scil3 = [1, 2, 3, 4, 5];
let scil4 = scil3.splice(1, 2);
console.log(scil3)

//- Дан масив [1, 2, 3, 4, 5].
//За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
let m1 = [1, 2, 3, 4, 5];
let m2 = m1.splice(3, 2, 'a', 'b', 'c', 4, 5);
console.log(m1);

//- Дан масив [1, 2, 3, 4, 5].
//За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
let m1 = [1, 2, 3, 4, 5];
let m2 = m1.splice(1, 4, 'a', 'b', 2, 3, 4, 'c', 5, 'e');
console.log(m1);

//- Взяти масив з 10 чисел або створити його.  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//Вивести в консоль тільки ті елементи, значення яких є парними.
let m = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
let m2 = m.filter(m % 2 == 0);
console.log(m2);

//- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
let m = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
let m2 = [];
for (let i = 0; i < m.length; i++) {
    if (i < m.length) {
        m2.push(m[i])
    }
} console.log(m2);

//- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
//За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
let m = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
let m2 = [];
m2.unshift([].concat(m));
console.log(m2);

//зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//1. перебрати його циклом while
//2. перебрати його циклом for
//3. перебрати циклом while та вивести  числа тільки з непарним індексом
//4. перебрати циклом for та вивести  числа тільки з непарним індексом
//5. перебрати циклом while та вивести  числа тільки парні  значення
//6. перебрати циклом for та вивести  числа тільки парні  значення
//7. замінити кожне число кратне 3 на слово "okten"
//8. вивести масив в зворотньому порядку.
//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//10

//1
let m = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
i = 0;
while (i < m.length) {
    console.log(m[i]);
    i++;
};
//2
for (let i = 0; i < m.length; i++) {
    document.write(m[i]);
}
//3
let m = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
i = 0;
while (i <= m.length) {
    if (i % 2 !== 0) {
        console.log(m[i]);
    }
    i++;
};
//4
for (let i = 0; i <= m.length; i++) {
    if (i % 2 !== 0) {
        document.write(m[i]);
    }
}

//5
let m = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
i = 0;
while (i < m.length) {
    if (m[i] % 2 == 0) {
        console.log(m[i]);
    }
    i++;
};
//6
for (let i = 0; i <= m.length; i++) {
    if (m[i] % 2 == 0) {
        document.write(m[i]);
    }
}

//7
let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (i = 0; i < arr.length; i++) {
    if (arr[i] % 3 == 0) {
        arr[i] = 'okten'
    } console.log(arr[i])
}
//8
let m = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let m2 = m.reverse();
for (let i = 0; i < m.length; i++) {
    document.write(m2[i])
}
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//let m = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//i = 0;
//while (i < m.length) {
//    console.log(m[i]);
//    i++;
//};

// створити пустий масив та :

// 3. вывести на консоль  каждый третий елемент
// но при условии что его значение является парным.
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
//  5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
//
//3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.

//- Взяти масив з 10 чисел або створити його.  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//Вивести в консоль тільки ті елементи, значення яких є парними.
//let m = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
//let m2 = m.filter(number => m.length % 2 == 0);
//console.log(m2);
//1. заповнити його 50 парними числами за допомоги циклу.
//2. заповнити його 50 непарними числами за допомоги циклу.
let arr2 = [];
for (let i = 0; i < 50; i++) {
    if (i % 2 == 0) {
        arr2.push(i);
    }
} document.write(arr2);

let arr = [];
for (let i = 0; i < 50; i++) {
    if (i % 2 !== 0) {
        arr.push(i);
    }
} console.log(arr);

//3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
let emptyArray = [];
while (emptyArray.length < 100) {
    let h = Math.floor((Math.random() * 1000) + 1);
    emptyArray.push(h)
}
console.log(emptyArray)
// диапазон рандома 8 до 732
let emptyArray1 = [];
for (i = 8; i < 732; i++) {
    let i = Math.floor((Math.random() * 732) + 1);
    emptyArray1.push(i)
}
document.write(emptyArray1)
*/

